brew "coreutils" # GNU core utilities (those that come with OS X are outdated)
brew "findutils" # GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew "wget"
brew "zsh"
brew "tmux"
brew "git"
brew "fzf"
brew "vim"
brew "nushell" # https://github.com/nushell/nushell -- A new type of shell
brew "yazi" # https://github.com/sxyazi/yazi
brew "lf" # https://github.com/gokcehan/lf
brew "poppler"# https"://poppler.freedesktop.org
brew "ffmpegthumbnailer"
brew "jstkdng/programs/ueberzugpp"
brew "tree"
brew "xclip"
brew "xsel"
brew "wmctrl"
brew "fish"
brew "github/gh/gh"
brew "translate-shell"
brew "mise" # asdf alternative
brew "exercism"
brew "todo-txt"
brew "tig" # https://github.com/jonas/tig -- Text-mode interface for git
brew "jq" # https://github.com/stedolan/jq
tap "libsql/sqld"

# brew "harelba/q/q" # http://harelba.github.io/q/ -- q - Run SQL directly on CSV or TSV files
# tap "kaplanelad/tap"
# brew "shellfirm"

brew "yatharth/misc/wolframalpha-cli" # https://github.com/yatharth/wolframalpha-cli -- query wolframalpha from cli `wa`
brew "entr" # https://github.com/eradman/entr
brew "direnv" # https://github.com/direnv/direnv
brew "bash-snippets" # https://github.com/alexanderepstein/Bash-Snippets
brew "lorem"
brew "khal" # https://github.com/pimutils/khal
brew "vdirsyncer" # https://github.com/pimutils/vdirsyncer
brew "glab" # https://gitlab.com/gitlab-org/cli
brew "youtube-dl" # https://github.com/ytdl-org/youtube-dl
brew "fastfetch" # https://github.com/fastfetch-cli/fastfetch
brew "openssl"
brew "neovim" # Vim-fork focused on extensibility and usability (https://github.com/neovim/neovim)
brew "gopass" # https://github.com/gopasspw/gopass
brew "notmuch" # https://notmuchmail.org
brew "btop" # https://github.com/aristocratos/btop
brew "mpv" # https://mpv.io/
brew "gnuPG" # the gnu Privacy Guard https://www.gnupg.org/
