cargo "difftastic"
cargo "diskonaut"
cargo "speedtest-rs"
cargo "porsmo"
cargo "calc"
cargo "impala"
cargo "bluetui"
cargo "wiremix"
cargo "dysk"

go "github.com/nikitavoloboev/gitupdate"

brew "coreutils" # GNU core utilities (those that come with OS X are outdated)
brew "findutils" # GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew "wget"
brew "zsh"
brew "tmux"
brew "git"
brew "git-delta" # https://github.com/dandavison/delta -- A viewer for git and diff output
brew "fzf"
brew "eza" # https://github.com/eza-community/eza
brew "ripgrep" # Ripgrep - fzf/vim is configured to use this
brew "vim"
brew "procs" # A modern replacement for ps written in Rust -- https://github.com/dalance/procs
brew "sd" # https://github.com/chmln/sd -- Intuitive find & replace CLI (sed alternative)
brew "dust" # https://github.com/bootandy/dust -- A more intuitive version of du in rust
brew "tokei" # Count your code, quickly. https://github.com/XAMPPRocky/tokei
brew "tealdeer" # https://github.com/dbrgn/tealdeer -- A very fast implementation of tldr in Rust.
brew "bandwhich" # https://github.com/imsnif/bandwhich -- Terminal bandwidth utilization tool
brew "grex" # https://github.com/pemistahl/grex -- A command-line tool and library for generating regular expressions from user-provided test cases
brew "zoxide" # https://github.com/ajeetdsouza/zoxide -- A smarter cd command. Supports all major shells.
brew "nushell" # https://github.com/nushell/nushell -- A new type of shell
brew "yazi" # https://github.com/sxyazi/yazi
brew "lf" # https://github.com/gokcehan/lf
brew "poppler"# https"://poppler.freedesktop.org
brew "ffmpegthumbnailer"
brew "jstkdng/programs/ueberzugpp"
brew "bottom" # https://github.com/ClementTsang/bottom -- Yet another cross-platform graphical process/system monitor.
brew "tree"
brew "xclip"
brew "xsel"
brew "wmctrl"
brew "httpie" # https://github.com/httpie/httpie -- Modern, user-friendly command-line HTTP client for the API era
brew "fish"
brew "github/gh/gh"
brew "asciinema" # https://github.com/asciinema/asciinema -- Terminal session recorder video_camera
brew "translate-shell"
brew "mise" # asdf alternative
brew "glow"
brew "exercism"
brew "stylua"
brew "todo-txt"
brew "tig" # https://github.com/jonas/tig -- Text-mode interface for git
brew "fx" # https://github.com/antonmedv/fx/ Command-line tool and terminal JSON viewer fire
brew "jq" # https://github.com/stedolan/jq -- https://github.com/stedolan/jq
tap "libsql/sqld"

# brew "harelba/q/q" # http://harelba.github.io/q/ -- q - Run SQL directly on CSV or TSV files
# tap "kaplanelad/tap"
# brew "shellfirm"

brew "loc" # https://github.com/cgag/loc -- Count lines of code quickly.
brew "croc" # https://github.com/schollz/croc -- Easily and securely send things from one computer to another
brew "massren" # https://github.com/laurent22/massren -- easily rename multiple files using your text editor
brew "xsv" # https://github.com/BurntSushi/xsv -- A fast CSV command line toolkit written in Rust.
brew "yatharth/misc/wolframalpha-cli" # https://github.com/yatharth/wolframalpha-cli -- query wolframalpha from cli `wa`
brew "slides" # https://github.com/maaslalani/slides
brew "efm-langserver" # https://github.com/mattn/efm-langserver
brew "ghq" # https://github.com/x-motemen/ghq
# brew "thefuck" # https://github.com/nvbn/thefuck
brew "entr" # https://github.com/eradman/entr
brew "hexyl" # https://github.com/sharkdp/hexyl
brew "duf" # https://github.com/muesli/duf -- Disk Usage/Free Utility - a better 'df' alternative
brew "dog" # https://github.com/ogham/dog
brew "scmpuff" # https://github.com/mroth/scmpuff
brew "direnv" # https://github.com/direnv/direnv
brew "egoist/tap/dum" # https://github.com/egoist/dum
brew "pnpm" # https://pnpm.io/
brew "bash-snippets" # https://github.com/alexanderepstein/Bash-Snippets
brew "gron" # https://github.com/tomnomnom/gron
brew "scc" # https://github.com/boyter/scc
brew "lorem"
brew "gum"
brew "noborus/tap/trdsql" # https://github.com/noborus/trdsql -- CLI tool that can execute SQL queries on CSV, LTSV, JSON and TBLN. Can output to various formats.
brew "tig" # https://jonas.github.io/tig/
brew "khal" # https://github.com/pimutils/khal
brew "vdirsyncer" # https://github.com/pimutils/vdirsyncer
brew "charmbracelet/tap/mods" # https://github.com/charmbracelet/mods/
brew "youtube-dl" # https://github.com/ytdl-org/youtube-dl
brew "glab" # https://gitlab.com/gitlab-org/cli
brew "zx" # https://google.github.io/zx/setup
brew "starship" # https://github.com/starship/starship
brew "bat" # https://github.com/sharkdp/bat
# brew "chafa" # https://github.com/hpjansson/chafa Terminal graphics
# brew "chroma" # https://github.com/alecthomas/chroma
brew "fastfetch" # https://github.com/fastfetch-cli/fastfetch
brew "trash-cli" # https://github.com/andreafrancia/trash-cli
brew "openssl"
brew "neovim" # Vim-fork focused on extensibility and usability (https://github.com/neovim/neovim)
brew "sshs" # Terminal user interface for SSH (https://github.com/quantumsheep/sshs)
brew "git-absorb" # https://github.com/tummychow/git-absorb
brew "sesh" # https://github.com/joshmedeski/sesh
brew "gopass" # https://github.com/gopasspw/gopass
brew "notmuch" # https://notmuchmail.org
brew "btop" # https://github.com/aristocratos/btop
brew "lazydocker" # https://github.com/jesseduffield/lazydocker
brew "btop" # https://github.com/aristocratos/btop
brew "mpv" # https://mpv.io/
brew "hyperfine" # https://github.com/sharkdp/hyperfine
